app/views/articles/show.html.haml

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 3]]
---
  %p.tags
    - @article.tags.each do |tag|

SELECT "comments".* FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 1]]
---

  %h3.comment-title Comments (#{@article.comments.size})