app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "picture", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sdgdf"], ["created_at", "2014-08-27 13:08:26.203631"], ["picture", "2.png"], ["title", "dfg"], ["updated_at", "2014-08-27 13:08:26.203631"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "picture" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["picture", "Django.jpg"], ["updated_at", "2014-08-27 13:16:05.517317"]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)